src/projects/configuration/251027_GKSTCPLK-1788/src/DataProcessors/гкс_АРМКомпозитныеПробы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>гкс_АРМКомпозитныеПробы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Силос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСостояний</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/Enums/гкс_ТипыПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_ТипыПроб</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Композитная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/Documents/гкс_ФормированиеНомераПробы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>гкс_ФормированиеНомераПробы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПробы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_НомерПробы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Comment>ERP-1431</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/DataProcessors/гкс_АРМКомпозитныеПробы/Forms/ФормаФормированиеКомпозитнойФормы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СформироватьКомпозитнуюПробу") Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ДопПараметры); 
		СтанцияОтправленияПредставление = Параметры.ДопПараметры.СтанцияОтправленияПредставление;
		ТабРегистраций = гкс_ПриемкаНаПЛКСервер.ПолучитьСписокРегистрацийВКомпозит(Параметры.ДопПараметры);
		
		Если ТабРегистраций.Количество() > 0 Тогда
			Объект.ТаблицаРегистраций.Загрузить(ТабРегистраций);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРегистраций

&НаКлиенте
Процедура СписокРегистрацийДокументРегистрацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокРегистраций.ТекущиеДанные;
	ТекущиеДанные.ВесНетто = ПолучитьВесНетто(ТекущиеДанные.ДокументРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСформироватьКомпозитнуюПробу(Команда)
	
	СформироватьДокумент();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДокумент()
	
	Если Объект.ТаблицаРегистраций.Количество() > 0 Тогда
		
		ДокументОбъект = Документы.гкс_ФормированиеНомераПробы.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.ТочкаМаршрута = Объект.ТочкаМаршрута;
		ДокументОбъект.ТипПробы = Перечисления.гкс_ТипыПроб.Композитная;
		ДокументОбъект.ПроизводственныеСуткиРегистрации = Объект.ПроизводственныеСуткиРегистрации;
		
		Для Каждого Строка Из Объект.ТаблицаРегистраций Цикл
			НоваяРегистрация = ДокументОбъект.СписокРегистраций.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяРегистрация, Строка);
		КонецЦикла;
		
		Отказ = Ложь;
		Документы.гкс_ФормированиеНомераПробы.СформироватьНомерПробы(ДокументОбъект, Отказ);
		ЧасовойПоясПЛК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДокументОбъект.ТочкаМаршрута, "гкс_ЧасовойПоясТочкиМаршрута");
		
		Если ЗначениеЗаполнено(ЧасовойПоясПЛК) Тогда
			ДокументОбъект.МестнаяДата = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПоясПЛК);
		Иначе
			ДокументОбъект.МестнаяДата = ДокументОбъект.Дата;
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВесНетто(ДокументРегистрации)
		
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "ВесНетто");
	
КонецФункции

#КонецОбласти
